app/controllers/chat_controller.rb

SELECT "conversations".* FROM "conversations" ORDER BY "conversations"."updated_at" DESC
---
  def index
    @conversations = Conversation.order(updated_at: :desc)

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 1 ORDER BY "messages"."created_at" ASC
---
  def show
    @conversation = Conversation.find(params[:id])
    @messages = @conversation.messages.ordered

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = 1 LIMIT 1
INSERT INTO "messages" ("conversation_id", "content", "role", "image_url", "created_at", "updated_at") VALUES (1, 'generate a monkey who is eating a banana', 'user', NULL, '2025-08-01 12:08:19.908595', '2025-08-01 12:08:19.908595') RETURNING "id"
INSERT INTO "messages" ("conversation_id", "content", "role", "image_url", "created_at", "updated_at") VALUES (1, 'I''m sorry, I couldn''t generate an image for your prompt. Please try again with a different description.', 'assistant', NULL, '2025-08-01 12:08:21.029808', '2025-08-01 12:08:21.029808') RETURNING "id"
UPDATE "conversations" SET "updated_at" = '2025-08-01 12:08:21.131616' WHERE "conversations"."id" = 1
---
  def create_message
    @conversation = Conversation.find(params[:conversation_id])
    user_message = @conversation.messages.create!(
      content: params[:content],
      role: "user"
    )

    # Generate image using ClipDrop API
    image_url = ClipdropService.generate_image(params[:content])

    # Create assistant response
    assistant_content = if image_url
      "I've generated an image based on your prompt: '#{params[:content]}'. Here it is!"
    else
      "I'm sorry, I couldn't generate an image for your prompt. Please try again with a different description."
    end

    @conversation.messages.create!(
      content: assistant_content,
      role: "assistant",
      image_url: image_url
    )

    @conversation.update!(updated_at: Time.current)

INSERT INTO "conversations" ("title", "created_at", "updated_at") VALUES ('New Conversation 2025-08-01 12:07', '2025-08-01 12:07:23.887698', '2025-08-01 12:07:23.887698') RETURNING "id"
---
  def new_conversation
    @conversation = Conversation.create!(title: "New Conversation #{Time.current.strftime('%Y-%m-%d %H:%M')}")

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = 1 LIMIT 1
UPDATE "conversations" SET "title" = 'first chat', "updated_at" = '2025-08-01 12:20:10.349506' WHERE "conversations"."id" = 1
---
  def update_conversation
    @conversation = Conversation.find(params[:id])
    if @conversation.update(title: params[:title])

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = 1 LIMIT 1
DELETE FROM "conversations" WHERE "conversations"."id" = 1
---
  def delete_conversation
    @conversation = Conversation.find(params[:id])
    @conversation.destroy